/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   err_tools.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mmachida <mmachida@student.42tokyo.jp>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/05/11 16:46:49 by mmachida          #+#    #+#             */
/*   Updated: 2025/05/11 16:46:49 by mmachida         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
	エラーメッセージを出力して処理を終了する
*/
void	error(char *msg)
{

	ft_printf(2, msg, len);
	exit (EXIT_FAILURE);
